Revit 2027 API
BuiltInFailures.HostObjFailures.HostMismatch Property
 Can't use this type in this host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostMismatch { get; }
Public Shared ReadOnly Property HostMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostMismatch {
	FailureDefinitionId^ get ();
}
static member HostMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HostObjFailures Class
Autodesk.Revit.DB Namespace